In [ ]:
"""
(1) Write an SQL query to show the top n (say 10) records of a table.

=> SELECT TOP 10 * FROM Customers;


      another way is 

  select *from Customers limit 0,10;

"""

In [ ]:
"""
(2) Write an SQL query to determine the nth (say n=5) highest salary from a table.

=>    select min(SALARY) from (select distinct SALARY from EMPLOYEE order by SALARY desc) where rownum < n+1 ; 

                             EMPLOYEE
                        NAME          SALARY 
                        ATUL          20000  
                        BUSHAN        30000
                        SUNNY         40000
                        RAJU          37000
                        RAJ           32000 

         for n=5 

       select min(SALARY) from (select distinct SALARY from EMPLOYEE order by SALARY desc) where rownum < 6 ;  

 """